app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."published" = ? AND (title like '%Hola%')  [["published", 1]]
---
    def index
        posts = Post.where(published: true) # all posts published

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show #show post published
        post = Post.find(params[:id])

INSERT INTO "posts" ("title", "content", "published", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "titulo"], ["content", "content"], ["published", 0], ["user_id", 1], ["created_at", "2022-09-02 01:04:58.530372"], ["updated_at", "2022-09-02 01:04:58.530372"]]
---
    def create
        post = Current.user.posts.create!(create_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "published" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "titulo"], ["content", "content"], ["published", 1], ["updated_at", "2022-09-02 01:04:58.558921"], ["id", 1]]
---
    def update
        post = Current.user.posts.find(params[:id])
        post.update!(update_params)